---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricWireType
source: html/4637aea2-5d5c-9dc3-832d-633b3d6fdfef.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricWireType Property

"Wire type": The wire type assigned

## Syntax (C#)
```csharp
public static ForgeTypeId FabricWireType { get; }
```